Tekla.Structures.Model.RebarMesh
The RebarMesh class represents a reinforcement mesh.
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
public class Example
{
public void Example1()
{
ContourPlate CP = new ContourPlate();
RebarMesh RebarMesh = new RebarMesh();
RebarMesh.MeshType = Tekla.Structures.Model.RebarMesh.RebarMeshTypeEnum.RECTANGULAR_MESH;
RebarMesh.Father = CP;
RebarMesh.StartPoint = new Point(3000, 0, 0);
RebarMesh.EndPoint = new Point(5000, 0, 0);
RebarMesh.CatalogName = "MyCatalog";
RebarMesh.LongitudinalSize = "6";
RebarMesh.CrossSize = "6";
RebarMesh.LeftOverhangCross = 20;
RebarMesh.LeftOverhangLongitudinal = 40;
RebarMesh.RightOverhangCross = 20;
RebarMesh.RightOverhangLongitudinal = 40;
RebarMesh.LongitudinalSpacingMethod = RebarMesh.RebarMeshSpacingMethodEnum.SPACING_TYPE_SAME_DISTANCE;
RebarMesh.LongitudinalDistances.Add(50.0);
RebarMesh.CrossDistances.Add(20.0);
RebarMesh.Name = "Mesh Test";
RebarMesh.Class = 7;
RebarMesh.NumberingSeries.StartNumber = 0;
RebarMesh.NumberingSeries.Prefix = "Mesh";
RebarMesh.Grade = "B500K";
RebarMesh.OnPlaneOffsets.Add(10.0);
RebarMesh.FromPlaneOffset = -50;
RebarMesh.StartPointOffsetType = Reinforcement.RebarOffsetTypeEnum.OFFSET_TYPE_COVER_THICKNESS;
RebarMesh.StartPointOffsetValue = 10;
RebarMesh.CutByFatherPartCuts = false;
RebarMesh.CrossBarLocation = Tekla.Structures.Model.RebarMesh.RebarMeshCrossBarLocationEnum.LOCATION_TYPE_ABOVE;
RebarMesh.Length = 1500;
RebarMesh.Width = 3500;
RebarMesh.Insert();
RebarMesh.Grade = "B600KX";
RebarMesh.LongitudinalSize = "8";
RebarMesh.RightOverhangLongitudinal = 75;
RebarMesh.Length = 1800;
RebarMesh.Width = 3800;
RebarMesh.Modify();
}
}

Tekla.Structures.Model.RebarMesh.MeshType
The type of the reinforcement mesh. The options are:
RECTANGULAR_MESH
POLYGON_MESH
BENT_MESH
Remarks: It is not possible to change the type of existing rebar meshes.

Tekla.Structures.Model.RebarMesh.LongitudinalSpacingMethod
The type of spacing between rebar mesh bars. Used both for longitudinal and crossing bars.
The options are (RebarMesh.RebarMeshSpacingMethodEnum.):
SPACING_TYPE_SAME_DISTANCE
SPACING_TYPE_MULTIPLE_VARYING_DISTANCES

Tekla.Structures.Model.RebarMesh.Polygon
The polygon of the mesh.

Tekla.Structures.Model.RebarMesh.LongitudinalDistances
The longitudinal spacing double value(s).

Tekla.Structures.Model.RebarMesh.CrossDistances
The crossing spacing double value(s).

Tekla.Structures.Model.RebarMesh.FromPlaneOffset
The offset value from the part surface applied in both sides.

Tekla.Structures.Model.RebarMesh.StartFromPlaneOffset
The start offset value from the part surface.

Tekla.Structures.Model.RebarMesh.EndFromPlaneOffset
The end offset value from the part surface.

Tekla.Structures.Model.RebarMesh.StartPoint
The start point of the direction in which the longitudinal bars are distributed.

Tekla.Structures.Model.RebarMesh.EndPoint
The end point of the direction in which the longitudinal bars are distributed.

Tekla.Structures.Model.RebarMesh.LeftOverhangLongitudinal
The overhang of the longitudinal bar's left side.

Tekla.Structures.Model.RebarMesh.LeftOverhangCross
The overhang of the crossing part's left side.

Tekla.Structures.Model.RebarMesh.RightOverhangLongitudinal
The right overhang of the longitudinal bar.

Tekla.Structures.Model.RebarMesh.RightOverhangCross
The right overhang of the crossing bar.

Tekla.Structures.Model.RebarMesh.LongitudinalSize
The size of the longitudinal rebar.

Tekla.Structures.Model.RebarMesh.CrossSize
The size of the crossing rebar.

Tekla.Structures.Model.RebarMesh.Width
The width of the rectangle rebar mesh.

Tekla.Structures.Model.RebarMesh.Length
The length of the rectangle rebar mesh.

Tekla.Structures.Model.RebarMesh.CutByFatherPartCuts
Defines whether the rebar mesh is cut by father part cuts or not.

Tekla.Structures.Model.RebarMesh.CatalogName
The name of the rebar mesh catalog.

Tekla.Structures.Model.RebarMesh.CrossBarLocation
Defines the location of the crossing bars.

Tekla.Structures.Model.RebarMesh.StartHook
The hook at the beginning of the reinforcing.

Tekla.Structures.Model.RebarMesh.EndHook
The hook at the end of the reinforcing.

Tekla.Structures.Model.RebarMesh.#ctor
Initializes a new mesh instance with empty attributes.

Tekla.Structures.Model.RebarMesh.Insert
Inserts the reinforcement mesh into the model database. All the attributes must be set.
Returns: True on success.

Tekla.Structures.Model.RebarMesh.Select
Selects a reinforcement mesh from the model database. The reinforcement identifier must be set.
Returns: True on success.

Tekla.Structures.Model.RebarMesh.Modify
Modifies the existing reinforcement mesh in the model database to match the current one.
Returns: True on success.

Tekla.Structures.Model.RebarMesh.Delete
Deletes the reinforcement mesh instance with the given identifier from the model database.
Returns: True on success.